// 1 - wall, 0 - space, 3 - exit (4 player spawn, 5 - frog)
// NORTH - 1, EAST - 2, SOUTH - 3, WEST - 4;
// # # # # # - эти строки так и так стенки, упростить массив.
// # E 0 F #   тогда можно представить в виде:
// # # F # #   [ 3, 0, 0 ], ( при этом ври получении вида не залезть за края массива )
// # F 0 P #   [ 1, 0, 1 ],
// # # # # #   [ 0, 0, 4 ]
levels = [
	{
		"matrix":
		[
			[3,0,7],
			[1,0,1],
			[0,0,4]
		],
		"direction" : 4
	},
	{
		"matrix":
		[
			[0,1,7,1],
			[0,0,0,1],
			[4,1,0,0],
			[0,1,1,3],
		]
	},
	{
		"matrix":
		[
			[7,0,0,1,3],
			[1,1,0,1,0],
			[0,0,0,0,0],
			[1,0,1,0,1],
			[0,0,1,0,4]
		],
		"direction" : 4
	},
	{
		"matrix":
		[
			[3,1,1,0,0,0],
			[0,1,1,0,1,0],
			[0,1,0,0,1,0],
			[0,1,0,1,0,0],
			[0,0,0,0,1,4],
			[7,1,0,1,1,0]
		]
	},
	{
		"matrix":
		[
			[0,0,4,1,1,1,0],
			[0,1,1,3,0,0,7],
			[0,0,0,1,1,0,1],
			[1,1,0,0,1,0,1],
			[1,0,0,1,1,0,0],
			[1,0,1,1,0,0,1],
			[0,0,0,0,0,1,1]
		],
		"direction" : 4
	}
];